{"_path":"/projects/anonymous-project-vue-nuxt-autonomous-vehicle-app","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Nuxt-based PWA and Mapping Framework","description":"For over a year, I worked with a company in the autonomous vehicle industry that designs and manufactures self-driving warehouse vehicles. The initial engagement started with a straightforward goal: to engineer an application for monitoring the location and status of vehicles as they navigated a warehouse floor. The Nuxt-based progressive web application was bundled with server images that were sent to warehouses across the country.","projectDate":"2021-07-01T05:00:00.000Z","postDate":"2021-07-01T05:00:00.000Z","shortIntro":true,"backgroundImage":"/images/projects/anonymous-project--vue-nuxt-autonomous-vehicle-app/green-line-background.jpg","screenshotImage":"/images/projects/anonymous-project--vue-nuxt-autonomous-vehicle-app/thumbnail.jpg","summary":"Nuxt, Vue, and OpenLayers were used to engineer a PWA and mapping framework for this autonomous vehicle company.","thumbnail":"/images/projects/anonymous-project--vue-nuxt-autonomous-vehicle-app/thumbnail.jpg","quote":"[Jordan] is a brilliant developer and problem-solver, a gifted analytical thinker, and a capable and confident leader. Jordan's technical skills and leadership capabilities were exemplified during the development of a package for drawing geographical maps. Jordan led the development of this package, which would be used in multiple applications. Jordan took painstaking detail to design the package's API in a way that was both ergonomic and extensible. Collaborating with Jordan as a consumer of the package was a highly enjoyable process. He took great care to incorporate feedback through an iterative process, and ensured that the package had stellar documentation and thorough test coverage. <mark>His thoughtfulness and attention to detail while leading this project were second-to-none.</mark>","quoteAuthor":"Technical Director, Sparkbox","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For over a year, I worked with a company in the autonomous vehicle industry that designs and manufactures self-driving warehouse vehicles. The initial engagement started with a straightforward goal: to engineer an application for monitoring the location and status of vehicles as they navigated a warehouse floor. The Nuxt-based progressive web application was bundled with server images that were sent to warehouses across the country."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The success of the engagement led the client to expand the scope, including the development of a component library and the creation of a private installable mapping framework for rendering warehouse maps, routes, and vehicle locations in other JavaScript-based applications. As the tech lead, I oversaw the technical discovery, architecture, planning, and execution of a domain-driven framework with a comprehensive set of APIs for other developers within the organization. This package, constructed on the widely-used and efficient canvas-based OpenLayers, provided robust support for rendering and updating hundreds of thousands of individual data points through WebSockets with minimal latency."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:anonymous-project--vue-nuxt-autonomous-vehicle-app.md","_source":"content","_file":"projects/anonymous-project--vue-nuxt-autonomous-vehicle-app.md","_stem":"projects/anonymous-project--vue-nuxt-autonomous-vehicle-app","_extension":"md"}