{"_path":"/projects/sparkhero","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"SparkHero!","description":"What better way to learn how to build pure-JavaScript web applications without the use of a UI framework? While I co-led Sparkbox's Full Stack Developer program, I was tasked with improving and streamlining the apprenticeship curriculum. Enter SparkHero.","projectDate":"2022-05-25T00:00:00-05:00","postDate":"2022-05-25T00:00:00-05:00","backgroundImage":"/images/projects/sparkhero/sparkhero-large-screenshot.jpeg","screenshotImage":"/images/projects/sparkhero/sparkhero-macbook-pro.png","shortIntro":true,"featured":false,"summary":"An exciting practical exercise for Sparkbox Apprentices to refine their web application building skills.","thumbnail":"/images/projects/sparkhero/sparkhero-logo.jpeg","projectUrl":"https://github.com/jordanleven/sparkbox-apprenticeship-sparkhero","quote":"Jordan and I co-led our Full-Stack Development Apprenticeship for several years. He picked up the programming section after a team member moved on. Jordan redesigned the curriculum; our apprentices went from haphazard lectures and a college-style syllabus to defined, project-based learning with established goals and outcomes. He organized other members of the development team to teach lessons. He even created a template repository to provide an entry point for very junior developers to build new applications on their own. He's an accomplished mentor and efficient problem-solver. <mark>He makes people better just by working with them.</mark>","quoteAuthor":"Technical Director, Sparkbox","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What better way to learn how to build pure-JavaScript web applications without the use of a UI framework? While I co-led "},{"type":"element","tag":"a","props":{"href":"https://apprentices.sparkbox.com/","rel":["nofollow"]},"children":[{"type":"text","value":"Sparkbox's Full Stack Developer program"}]},{"type":"text","value":", I was tasked with improving and streamlining the apprenticeship curriculum. "},{"type":"element","tag":"a","props":{"href":"https://github.com/jordanleven/sparkbox-apprenticeship-sparkhero","rel":["nofollow"]},"children":[{"type":"text","value":"Enter SparkHero"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"SparkHero is an exercise that challenges apprentices to build a JavaScript app with ready-to-go RESTful APIs that show off fan-favorite Marvel and DC characters. It covers all the disciplines previously addressed in ad hoc lessons on building web applications, but in a structured manner that closely resembles the leadership of real client projects. Throughout this two-week exercise, apprentices were tasked with adding new features such as support for fetching data from API endpoints, sorting, and filtering."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This project comes preloaded with three RESTful API endpoints compatible with "},{"type":"element","tag":"a","props":{"href":"https://www.netlify.com/products/functions/","rel":["nofollow"]},"children":[{"type":"text","value":"Netlify serverless functions"}]},{"type":"text","value":", Express, Webpack, Jest, Sass, a complete set of linters, and a customized CI/CD pipeline to automate deployments to Netlify for both pull requests and code merged into the production branch."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:sparkhero.md","_source":"content","_file":"projects/sparkhero.md","_stem":"projects/sparkhero","_extension":"md"}